Revit 2027 API
BuiltInFailures.JoinElementsFailures.CannotJoinElementsStructuralError Property
 Can't keep elements joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotJoinElementsStructuralError { get; }
Public Shared ReadOnly Property CannotJoinElementsStructuralError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotJoinElementsStructuralError {
	FailureDefinitionId^ get ();
}
static member CannotJoinElementsStructuralError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace